app/controllers/application_controller.rb

    def set_user_info
         @user_info=User.find_by(id: params[:id],name: params[:name])
---
SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL AND "users"."name" IS NULL LIMIT ?  [["LIMIT", 1]]