app/controllers/posts_controller.rb

  def create
    @post = Post.new(content: params[:content], image_post: "noimage.png")

    if @post.save
---
INSERT INTO "posts" ("content", "created_at", "updated_at", "image_post") VALUES (?, ?, ?, ?)  [["content", "aaaa"], ["created_at", "2021-01-31 04:36:10.713169"], ["updated_at", "2021-01-31 04:36:10.713169"], ["image_post", ".jpg"]]