app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "a"], ["email", "abc"], ["password", "a"], ["created_at", "2021-02-02 07:34:46.824403"], ["updated_at", "2021-02-02 07:34:46.824403"]]
---
  def create
    @user = User.new(name: params[:name],
                     email: params[:email],
                     password: params[:password])

    if @user.save